ДО_для_разработки/src/Catalogs/Яндекс_НастройкиСинхронизации/Яндекс_НастройкиСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Яндекс_НастройкиСинхронизации</name>
  <predefined>
    <items>
      <name>НастройкиПоУмолчанию</name>
      <description>Настройки по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Устройство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ДО_для_разработки/src/Catalogs/Яндекс_НастройкиСинхронизации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	ВосстановитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере()
	
	Объект.ВидПроекта = Справочники.ВидыПроектов.НайтиПоНаименованию("Проекты");
	Объект.ДлительностьДней = 1;
	Объект.ИдОрганизации = "3325382";
	Объект.Папка = Справочники.ПапкиПроектов.НайтиПоНаименованию("Проекты в работе");
	Объект.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ГАПУУ");
	Объект.Руководитель = Справочники.Пользователи.НайтиПоНаименованию("Иванов Константин Владиславович");
	Объект.Токен = "AgAAAAA1wK4OAAXk8lr7vrH8pki-qa6ZFyvdgWM";
	Объект.Устройство = "111111";	

КонецПроцедуры
